Revit 2027 API
PipePressureDropData.NominalDiameter Property
 The nominal diameter of the pipe. Units: (ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NominalDiameter { get; }
Public ReadOnly Property NominalDiameter As Double
	Get
public:
property double NominalDiameter {
	double get ();
}
member NominalDiameter : float with get
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace